INSERT INTO lessontime (id, start_time, end_time) VALUES
    (1, '09:10:00', '10:00:00'), 
    (2, '10:10:00', '11:00:00'), 
    (3, '11:10:00', '12:00:00'), 
    (4, '12:50:00', '13:40:00'), 
    (5, '13:50:00', '14:40:00'), 
    (6, '14:50:00', '15:40:00'), 
    (7, '15:50:00', '16:40:00');

INSERT INTO departments (id,name) VALUES
    (110,"情報スペシャリスト学科"),
    (120,"情報システム学科"),
    (149,"ネット・動画クリエイター学科"),
    (133,"デジタルビジネス学科"),
    (280,"国際ITビジネス学科"),
    (320,"医療福祉事務学科"),
    (341,"ホテル・ブライダル・観光学科"),
    (351,"医療情報マネジメント学科"),
    (311,"経営アシスト学科"),
    (330,"公務員総合学科");


INSERT INTO departments (id,name,course) VALUES
    (171,"ゲーム・VRクリエイター学科","ゲームクリエイターコース"),
    (172,"ゲーム・VRクリエイター学科","VRクリエイターコース"),
    (154,"CGデザイン学科","3DCGデザインコース"),
    (155,"CGデザイン学科","イラスト・デザインコース");

INSERT INTO classes (department_id) VALUES
    (110), 
    (120), 
    (149), 
    (133), 
    (341), 
    (320), 
    (351), 
    (311), 
    (330), 
    (280), 
    (171), 
    (172), 
    (154), 
    (155); 

INSERT INTO student_users (user_id,email,admission_year,full_name, class_id) VALUES
    (24110001,"24110001@oic-ok.ac.jp",2024,"三田博斗",1),
    (24110014,"24110014@oic-ok.ac.jp",2024,"岡本詩織",1),
    (24110030,"24110030@oic-ok.ac.jp",2024  ,"藤岡聖也",1);

INSERT INTO teacher_users (user_id,email,full_name) VALUES
    (24110011,"24110011@oic-ok.ac.jp","竹長祐菜"),
    (24110016,"24110016@oic-ok.ac.jp","篠原陵"),
    (24110024,"24110024@oic-ok.ac.jp","古中智規");